prplz/MounRiver-templates/WCH/ARM/CH32F207/NoneOS/CH32F207xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EXTEND</name>
      <description> Extend configuration</description>
      <groupName>EXTEND</groupName>
      <baseAddress>0x40023800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EXTEND_CTR</name>
          <displayName>EXTEND</displayName>
          <description>EXTEND register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>USBDLS</name>
              <description>USBD Lowspeed Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
               <field>
              <name>USBDPU</name>
              <description>USBD pullup Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
               <field>
              <name>ETH_10M_EN</name>
              <description>ETH 10M Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
               <field>
              <name>ETH_RGMII_EN</name>
              <description>ETH RGMII Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
               <field>
              <name>PLL_HSI_PRE</name>
              <description>Whether HSI is divided </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
               <field>
              <name>LOCKUP_EN</name>
              <description>LOCKUP_Eable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
               <field>
              <name>LOCKUP_RSTF</name>
              <description>LOCKUP RESET</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>    
                  <field>
              <name>ULLDO_TRIM</name>
              <description>ULLDO_TRIM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>  
                 <field>
              <name>LDO_TRIM</name>
              <description>LDO_TRIM</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>   
          </fields>
        </register>
      </registers>
    </peripheral>	
	<peripheral>
      <name>OPA</name>
      <description> OPA configuration</description>
      <groupName>OPA</groupName>
      <baseAddress>0x40023804</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>OPA1_EN</name>
              <description>OPA1 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
               <field>
              <name>OPA1_MODE</name>
              <description>OPA1_MODE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
               <field>
              <name>OPA1_NSEL</name>
              <description>OPA1_NSEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
               <field>
              <name>OPA1_PSEL</name>
              <description>OPA1_PSEL</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
               <field>
              <name>OPA2_EN</name>
              <description>OPA2 Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
			<field>
              <name>OPA2_MODE</name>
              <description>OPA2 MODE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
               <field>
              <name>OPA2_NSEL</name>
              <description>OPA2_NSEL</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
               <field>
              <name>OPA2_PSEL</name>
              <description>OPA2_PSEL</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>    
                  <field>
              <name>OPA3_EN</name>
              <description>OPA3 Eable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
                 <field>
              <name>OPA3_MODE</name>
              <description>OPA3 MODE</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
                 <field>
              <name>OPA3_NSEL</name>
              <description>OPA3 NSEL</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
                 <field>
              <name>OPA3_PSEL</name>
              <description>OPA3 PSEL</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
                 <field>
              <name>OPA4_EN</name>
              <description>OPA4 Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
                 <field>
              <name>OPA4_MODE</name>
              <description>OPA4_MODE</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 	
                 <field>
              <name>OPA4_NSEL</name>
              <description>OPA4_NSEL </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 	
                 <field>
              <name>OPA4_PSEL</name>
              <description>OPA4_PSEL</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 				
          </fields>
        </register>
