prplz/MounRiver-templates/WCH/ARM/CH32F207/NoneOS/CH32F207xx.svd
      </registers>
    </peripheral>
	<peripheral>
	<name>USB OTG FS</name>
		<description>USB FS OTG register</description>
		<groupName>USB OTG FS</groupName>
		<baseAddress>0x50000000</baseAddress>
		<addressBlock>
			<offset>0x00</offset>
			<size>0x40000</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>USBHSWakeup_IRQn</name>
			<description>USBHSWakeup_IRQn</description>
			<value>84</value>
		</interrupt>
		<interrupt>
		<name>USBHS_IRQn</name>
		<description>USBHS_IRQn</description>
			<value>85</value>
		</interrupt>
		<interrupt>
		<name>OTG_FS_IRQn</name>
		<description>OTG_FS_IRQn</description>
			<value>83</value>
		</interrupt>
		<registers>
			<register>
				<name>USBHD_BASE_CTRL</name>
				<description>USB base control</description>
				<addressOffset>0x00</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>USBHD_UC_DMA_EN</name>
						<description>DMA enable and DMA interrupt enable for USB</description>
						<bitRange>[0:0]</bitRange>		
					</field>
					<field>
						<name>USBHD_UC_CLR_ALL</name>
						<description>force clear FIFO and count of USB</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>USBHD_UC_RESET_SIE</name>
						<description>force reset USB SIE, need software clear</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UC_INT_BUSY</name>
						<description>enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>USBHD_UC_SYS_CTRL_MASK</name>
						<description>USB device enable and internal pullup resistance enable</description>
						<bitRange>[5:4]</bitRange>
					</field>
					<field>
						<name>USBHD_UC_LOW_SPEED</name>
						<description>enable USB low speed: 0=12Mbps, 1=1.5Mbps</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UC_HOST_MODE</name>
						<description>enable USB host mode: 0=device mode, 1=host mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
				</register>
			<register>
				<name>USBHD_UDEV_CTRL__USBHD_UHOST_CTRL</name>
				<description>USB device/host physical prot control</description>
				<addressOffset>0x01</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x06</resetValue>
				<fields>
					<field>
						<name>USBHD_UH_PORT_EN__USBHD_UD_PORT_EN</name>
						<description>enable USB port: 0=disable, 1=enable port, automatic disabled if USB device detached</description>
						<bitRange>[0:0]</bitRange>		
					</field>
					<field>
						<name>USBHD_UH_BUS_RESET__USBHD_UD_GP_BIT</name>
						<description>force clear FIFO and count of USB</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>USBHD_UH_LOW_SPEED__USBHD_UD_LOW_SPEED</name>
						<description>enable USB port low speed: 0=full speed, 1=low speed</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UH_DM_PIN__USBHD_UD_DM_PIN</name>
						<description>ReadOnly: indicate current UDM pin level</description>
						<bitRange>[4:4]</bitRange>
						<access>read-opnly</access>
					</field>
					<field>
						<name>USBHD_UH_DP_PIN__USBHD_UD_DP_PIN</name>
						<description>USB device enable and internal pullup resistance enable</description>
						<bitRange>[5:5]</bitRange>
						<access>read-opnly</access>
					</field>
					<field>
						<name>USBHD_UH_PD_DIS__USBHD_UD_PD_DIS</name>
						<description>disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
				</register>
			<register>
				<name>R8_USB_INT_EN</name>
				<description>USB interrupt enable</description>
				<addressOffset>0x02</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>USBHD_UIE_BUS_RST__USBHD_UIE_DETECT</name>
						<description>enable interrupt for USB bus reset event for USB device mode</description>
						<bitRange>[0:0]</bitRange>
					
					</field>
					<field>
						<name>USBHD_UIE_TRANSFER</name>
						<description>enable interrupt for USB transfer completion</description>
						<bitRange>[1:1]</bitRange>
						
					</field>
					<field>
						<name>USBHD_UIE_SUSPEND</name>
						<description>enable interrupt for USB suspend or resume event</description>
						<bitRange>[2:2]</bitRange>
						
					</field>
					<field>
						<name>USBHD_UIE_HST_SOF</name>
						<description>enable interrupt for host SOF timer action for USB host mode</description>
						<bitRange>[3:3]</bitRange>
						
					</field>
					<field>
						<name>USBHD_UIE_FIFO_OV</name>
						<description>enable interrupt for FIFO overflow</description>
						<bitRange>[4:4]</bitRange>
					
					</field>
					<field>
						<name>USBHD_UIE_DEV_NAK</name>
						<description>enable interrupt for NAK responded for USB device mode</description>
						<bitRange>[6:6]</bitRange>
					</field>
						<field>
						<name>USBHD_UIE_DEV_SOF</name>
						<description>enable interrupt for SOF received for USB device mode</description>
						<bitRange>[7:7]</bitRange>
					
					</field>
				</fields>
				</register>
			<register>
				<name>R8_USB_DEV_AD</name>
				<description>USB device address</description>
				<addressOffset>0x03</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>MASK_USB_ADDR</name>
						<description>bit mask for USB device address</description>
						<bitRange>[6:0]</bitRange>
						<access>read-write</access>
						</field>
						<field>
						<name>RB_UDA_GP_BIT</name>
						<description>general purpose bit</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
				</register>
			<register>
				<name>R8_USB_MIS_ST</name>
				<description>USB miscellaneous status</description>
				<addressOffset>0x05</addressOffset>
				<size>8</size>
				<access>read-only</access>
				<fields>
					<field>
						<name>RB_UMS_DEV_ATTACH</name>
						<description>RO, indicate device attached status on USB host</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UMS_DM_LEVEL</name>
						<description>RO, indicate UDM level saved at device attached to USB host</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SUSPEND</name>
						<description>RO, indicate USB suspend status</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UMS_BUS_RESET</name>
						<description>RO, indicate USB bus reset status</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UMS_R_FIFO_RDY</name>
						<description>RO, indicate USB receiving FIFO ready status (not empty)</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SIE_FREE</name>
						<description>RO, indicate USB SIE free status</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SOF_ACT</name>
						<description>RO, indicate host SOF timer action status for USB host</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SOF_PRES</name>
						<description>RO, indicate host SOF timer presage status</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_USB_INT_FG</name>
				<description>USB interrupt flag</description>
				<addressOffset>0x06</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_UIF_BUS_RST__RB_UIF_DETECT</name>
						<description>bus reset event interrupt flag for USB device mode, direct bit address clear or write 1 to clear;device detected event interrupt flag for USB host mode, direct bit address clear or write 1 to clear</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UIF_TRANSFER</name>
						<description>USB transfer completion interrupt flag, direct bit address clear or write 1 to clear</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UIF_SUSPEND</name>
						<description>USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UIF_HST_SOF</name>
						<description>host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UIF_FIFO_OV</name>
						<description>FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_U_SIE_FREE</name>
						<description>RO, indicate USB SIE free status</description>
						<bitRange>[5:5]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_U_TOG_OK</name>
						<description>RO, indicate current USB transfer toggle is OK</description>
						<bitRange>[6:6]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_U_IS_NAK</name>
						<description>RO, indicate current USB transfer is NAK received</description>
						<bitRange>[7:7]</bitRange>
						<access>read-only</access>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_USB_INT_ST</name>
				<description>USB interrupt status</description>
				<addressOffset>0x07</addressOffset>
				<size>8</size>
				<access>read-only</access>
				<fields>
					<field>
						<name>MASK_UIS_H_RES__MASK_UIS_ENDP</name>
						<description>RO, bit mask of current transfer handshake response for USB host mode: 0000=no response, time out from device, others=handshake response PID received;RO, bit mask of current transfer endpoint number for USB device mode</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>MASK_UIS_TOKEN</name>
						<description>RO, bit mask of current token PID code received for USB device mode</description>
						<bitRange>[5:4]</bitRange>
					</field>
					<field>
						<name>RB_UIS_TOG_OK</name>
						<description>RO, indicate current USB transfer toggle is OK</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UIS_IS_NAK</name>
						<description>RO, indicate current USB transfer is NAK received for USB device mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_USB_RX_LEN</name>
				<description>USB receiving length</description>
				<addressOffset>0x08</addressOffset>
				<size>16</size>
				<access>read-only</access>
			</register>
			<register>
				<name>R8_UEP4_1_MOD</name>
				<description>endpoint 4/1 mode</description>
				<addressOffset>0x0C</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_UEP4_TX_EN</name>
						<description>enable USB endpoint 4 transmittal (IN)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP4_RX_EN</name>
						<description>enable USB endpoint 4 receiving (OUT)</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP1_BUF_MOD</name>
						<description>buffer mode of USB endpoint 1</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP1_TX_EN</name>
						<description>enable USB endpoint 1 transmittal (IN)</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP1_RX_EN</name>
						<description>enable USB endpoint 1 receiving (OUT)</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UEP2_3_MOD__R8_UH_EP_MOD</name>
				<description>endpoint 2/3 mode;host endpoint mode</description>
				<addressOffset>0x0D</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_UEP2_BUF_MOD__RB_UH_EP_RBUF_MOD</name>
						<description>buffer mode of USB endpoint 2;buffer mode of USB host IN endpoint</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UEP2_TX_EN</name>
						<description>enable USB endpoint 2 transmittal (IN)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP2_RX_EN__RB_UH_EP_RX_EN</name>
						<description>enable USB endpoint 2 receiving (OUT);enable USB host IN endpoint receiving</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP3_BUF_MOD__RB_UH_EP_TBUF_MOD</name>
						<description>buffer mode of USB endpoint 3;buffer mode of USB host OUT endpoint</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP3_TX_EN__RB_UH_EP_TX_EN</name>
						<description>enable USB endpoint 3 transmittal (IN);enable USB host OUT endpoint transmittal</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP3_RX_EN</name>
						<description>enable USB endpoint 3 receiving (OUT)</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>        
				<name>R8_UEP5_6_MOD</name>
				<description>endpoint 5/6 mode</description>
				<addressOffset>0x0e</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UEP5_BUF_MOD</name>
						<description>buffer mode of USB endpoint 5</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UEP5_TX_EN</name>
						<description>enable USB endpoint 5 transmittal (IN)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP5_RX_EN</name>
						<description>enable USB endpoint 5 receiving (OUT)</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP6_BUF_MOD</name>
						<description>buffer mode of USB endpoint 6</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP6_TX_EN</name>
						<description>enable USB endpoint 6 transmittal (IN)</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP3_RX_EN</name>
						<description>enable USB endpoint 6 receiving (OUT)</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>        
				<name>R8_UEP7_MOD</name>
				<description>endpoint 7 mode</description>
				<addressOffset>0x0f</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UEP7_BUF_MOD</name>
						<description>buffer mode of USB endpoint 7</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UEP7_TX_EN</name>
						<description>enable USB endpoint 7 transmittal (IN)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP7_RX_EN</name>
						<description>enable USB endpoint 7 receiving (OUT)</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R32_UEP0_DMA</name>
				<description>endpoint 0 DMA buffer address</description>
				<addressOffset>0x10</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R32_UEP1_DMA</name>
				<description>endpoint 1 DMA buffer address</description>
				<addressOffset>0x14</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R32_UEP2_DMA__R32_UH_RX_DMA</name>
				<description>endpoint 2 DMA buffer address;host rx endpoint buffer high address</description>
				<addressOffset>0x18</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R32_UEP3_DMA__R32_UH_TX_DMA</name>
				<description>endpoint 3 DMA buffer address;host tx endpoint buffer high address</description>
				<addressOffset>0x1C</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				</register>
			<register>
				<name>R32_UEP4_DMA</name>
				<description>endpoint 4 DMA buffer address</description>
				<addressOffset>0x20</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				</register>
			<register>
				<name>R32_UEP5_DMA</name>
				<description>endpoint 5 DMA buffer address</description>
				<addressOffset>0x24</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				</register>   
			<register>
				<name>R32_UEP6_DMA</name>
				<description>endpoint 6 DMA buffer address</description>
				<addressOffset>0x28</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				</register>   
			<register>
				<name>R32_UEP7_DMA</name>
				<description>endpoint 7 DMA buffer address</description>
				<addressOffset>0x2c</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
			</register>  
			<register>
				<name>R8_UEP0_T_LEN</name>
				<description>endpoint 0 transmittal length</description>
				<addressOffset>0x30</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP0_T_CTRL</name>
				<description>endpoint 0 control</description>
				<addressOffset>0x32</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UEP0_R_CTRL</name>
				<description>endpoint 0 control</description>
				<addressOffset>0x33</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
			</register>			
			<register>
				<name>R8_UEP1_T_LEN</name>
				<description>endpoint 1 transmittal length</description>
				<addressOffset>0x34</addressOffset>
				<size>8</size>
				<access>read-write</access>
				</register>
			<register>
				<name>R8_UEP1_T_CTRL___USBHD_UH_SETUP</name>
				<description>endpoint 1 control</description>
				<addressOffset>0x36</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_T_TOG_</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
						<field>
						<name>USBHD_UH_SOF_EN</name>
						<description>USB host automatic SOF enable</description>
						<bitRange>[6:6]</bitRange>
						</field>
						<field>
						<name>USBHD_UH_PRE_PID_EN</name>
						<description>USB host PRE PID enable for low speed device via hub</description>
						<bitRange>[7:7]</bitRange>
						</field>
				</fields>
				</register>
			<register>
				<name>R8_UEP1_R_CTRL</name>
				<description>endpoint 1 control</description>
				<addressOffset>0x37</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UEP2_T_LEN__USBHD_UH_EP_PID</name>
				<description>endpoint 2 transmittal length</description>
				<addressOffset>0x38</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>USBHD_UH_ENDP_MASK</name>
						<description>bit mask of endpoint number for USB host transfer</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UH_TOKEN_MASK</name>
						<description>bit mask of token PID for USB host transfer</description>
						<bitRange>[7:4]</bitRange>
					</field>
				</fields>
				</register>
			<register>
				<name>R8_UEP2_T_CTRL</name>
				<description>endpoint 2 control</description>
				<addressOffset>0x3a</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_T_TOG_</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
				</register>
